### Terraform Plan - `stage` 환경

<details>
<summary>📋 Plan 결과 보기</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.mgmt[0]: Reading...
module.rds.random_id.secret_suffix: Refreshing state... [id=k0yfYQ]
module.rds.random_password.master: Refreshing state... [id=none]
module.eks.data.aws_region.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.aws_iam_role.cluster: Refreshing state... [id=kyeol-stage-eks-cluster-role]
module.vpc.data.aws_region.current: Reading...
module.eks.aws_cloudwatch_log_group.containers: Refreshing state... [id=/aws/eks/kyeol-stage-eks/containers]
module.rds.aws_db_parameter_group.main: Refreshing state... [id=kyeol-stage-rds-pg16]
module.eks.aws_iam_role.node_group: Refreshing state... [id=kyeol-stage-eks-node-role]
module.s3_phase3[0].aws_s3_bucket.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket.media[0]: Refreshing state... [id=kyeol-stage-media]
module.vpc.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.eks.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.rds.aws_secretsmanager_secret.rds: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:827913617839:secret:kyeol-stage-rds-creds-934c9f61-raBX7Z]
module.ecr.aws_ecr_repository.main["storefront"]: Refreshing state... [id=kyeol-stage-storefront]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=827913617839]
module.ecr.aws_ecr_repository.main["api"]: Refreshing state... [id=kyeol-stage-api]
module.ecr.aws_ecr_repository.main["dashboard"]: Refreshing state... [id=kyeol-stage-dashboard]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0ad4a01d15661ef1c]
module.s3_phase3[0].data.aws_caller_identity.current: Reading...
module.eks.aws_iam_role_policy_attachment.node_worker: Refreshing state... [id=kyeol-stage-eks-node-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.s3_phase3[0].data.aws_caller_identity.current: Read complete after 1s [id=827913617839]
module.eks.aws_iam_role_policy_attachment.node_cni: Refreshing state... [id=kyeol-stage-eks-node-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.eks.aws_iam_role_policy_attachment.node_cloudwatch: Refreshing state... [id=kyeol-stage-eks-node-role/arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy]
module.eks.aws_iam_role_policy_attachment.node_ssm: Refreshing state... [id=kyeol-stage-eks-node-role/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.eks.aws_iam_role_policy_attachment.node_ecr: Refreshing state... [id=kyeol-stage-eks-node-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks.aws_iam_role_policy_attachment.cluster_policy: Refreshing state... [id=kyeol-stage-eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.eks.aws_iam_role_policy_attachment.cluster_vpc_resource_controller: Refreshing state... [id=kyeol-stage-eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSVPCResourceController]
module.ecr.aws_ecr_lifecycle_policy.main["api"]: Refreshing state... [id=kyeol-stage-api]
module.ecr.aws_ecr_lifecycle_policy.main["dashboard"]: Refreshing state... [id=kyeol-stage-dashboard]
module.ecr.aws_ecr_lifecycle_policy.main["storefront"]: Refreshing state... [id=kyeol-stage-storefront]
data.terraform_remote_state.mgmt[0]: Read complete after 2s
module.vpc_peering_mgmt[0].data.aws_route_tables.requester: Reading...
module.vpc_peering_mgmt[0].data.aws_route_tables.requester: Read complete after 0s [id=ap-northeast-2]
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-084b40988ed914a0a"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-000b539ccd4cb4e50"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-0f469955ce9f75a5b"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-07babae8b6efcdce7"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-0f469955ce9f75a5b"]: Read complete after 1s [id=rtb-0f469955ce9f75a5b]
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-000b539ccd4cb4e50"]: Read complete after 1s [id=rtb-000b539ccd4cb4e50]
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-07babae8b6efcdce7"]: Read complete after 1s [id=rtb-07babae8b6efcdce7]
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-084b40988ed914a0a"]: Read complete after 1s [id=rtb-084b40988ed914a0a]
module.vpc.aws_default_security_group.default: Refreshing state... [id=sg-0a1e15a05d6c880da]
module.vpc.aws_security_group.alb: Refreshing state... [id=sg-0e579f0e074f80b15]
module.vpc.aws_subnet.data_private["a"]: Refreshing state... [id=subnet-09b53d0342ba93ae4]
module.vpc.aws_subnet.cache_private["c"]: Refreshing state... [id=subnet-0e311376245111865]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c389c9a08a8b7305]
module.vpc.aws_subnet.data_private["c"]: Refreshing state... [id=subnet-0444fbd5b939f20fe]
module.vpc.aws_security_group.cache[0]: Refreshing state... [id=sg-0a3e64ea36fb48387]
module.vpc.aws_subnet.cache_private["a"]: Refreshing state... [id=subnet-020a1528fb6811865]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0db7e97b1cc581f44]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0715f9a3f6c4e5e13]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0b847a4edf9d94f2d]
module.vpc_peering_mgmt[0].aws_vpc_peering_connection.main: Refreshing state... [id=pcx-0ae6e5066e4b085d3]
module.eks.aws_security_group.cluster: Refreshing state... [id=sg-07bfe205124c446aa]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-027538cc4e9d0f5e8]
module.vpc.aws_subnet.app_private[1]: Refreshing state... [id=subnet-0fa7a1288f6c802dc]
module.vpc.aws_subnet.app_private[0]: Refreshing state... [id=subnet-00baf413a2852dade]
module.vpc.aws_security_group.vpc_endpoints[0]: Refreshing state... [id=sg-0273fff56137933be]
module.vpc_peering_mgmt[0].data.aws_route_tables.accepter: Reading...
module.vpc.aws_security_group.rds[0]: Refreshing state... [id=sg-032ac96144bbd5ec8]
module.s3_phase3[0].aws_s3_bucket_ownership_controls.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket_public_access_block.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket_server_side_encryption_configuration.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket_lifecycle_configuration.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket_policy.logs_tls[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket_versioning.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket_server_side_encryption_configuration.media[0]: Refreshing state... [id=kyeol-stage-media]
module.s3_phase3[0].aws_s3_bucket_public_access_block.media[0]: Refreshing state... [id=kyeol-stage-media]
module.vpc_peering_mgmt[0].data.aws_route_tables.accepter: Read complete after 0s [id=ap-northeast-2]
module.s3_phase3[0].aws_s3_bucket_versioning.media[0]: Refreshing state... [id=kyeol-stage-media]
module.s3_phase3[0].aws_s3_bucket_policy.media_cloudfront[0]: Refreshing state... [id=kyeol-stage-media]
module.s3_phase3[0].aws_s3_bucket_ownership_controls.media[0]: Refreshing state... [id=kyeol-stage-media]
module.vpc_peering_mgmt[0].aws_vpc_peering_connection_options.requester: Refreshing state... [id=pcx-0ae6e5066e4b085d3]
module.vpc_peering_mgmt[0].aws_vpc_peering_connection_options.accepter: Refreshing state... [id=pcx-0ae6e5066e4b085d3]
module.vpc_peering_mgmt[0].aws_route.requester_to_accepter[1]: Refreshing state... [id=r-rtb-000b539ccd4cb4e50662290444]
module.vpc_peering_mgmt[0].aws_route.requester_to_accepter[0]: Refreshing state... [id=r-rtb-0f469955ce9f75a5b662290444]
module.vpc.aws_route_table_association.data_private["a"]: Refreshing state... [id=rtbassoc-0e2713f728b1146c5]
module.vpc.aws_route_table_association.data_private["c"]: Refreshing state... [id=rtbassoc-00bf951e0b42438e1]
module.vpc.aws_route_table_association.cache_private["c"]: Refreshing state... [id=rtbassoc-0c472922c05cb2374]
module.vpc.aws_route_table_association.cache_private["a"]: Refreshing state... [id=rtbassoc-0dd6ac2a8c7cc7612]
module.vpc.aws_route.public_internet: Refreshing state... [id=r-rtb-0b847a4edf9d94f2d1080289494]
module.vpc.aws_eip.internet[0]: Refreshing state... [id=eipalloc-07e62428bb63eca1e]
module.vpc.aws_eip.internet[1]: Refreshing state... [id=eipalloc-02566717ff42bb2d6]
module.eks.aws_security_group_rule.cluster_egress: Refreshing state... [id=sgrule-2026627799]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0798988f211e202a1]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c75adeb8d364f47e]
module.vpc.aws_route_table_association.app_private[1]: Refreshing state... [id=rtbassoc-0bd8edf452d27ca20]
module.vpc.aws_route_table_association.app_private[0]: Refreshing state... [id=rtbassoc-04bc7693c1b372b5a]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0b847a4edf9d94f2d"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0db7e97b1cc581f44"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0b4605bf73e2ffc7c"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-06c24fbaedfb5360a"]: Reading...
module.vpc.aws_vpc_endpoint.s3[0]: Refreshing state... [id=vpce-0c26d760707c483d3]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0b847a4edf9d94f2d"]: Read complete after 0s [id=rtb-0b847a4edf9d94f2d]
module.vpc.aws_vpc_endpoint.ecr_api[0]: Refreshing state... [id=vpce-07536eddabf796809]
module.vpc.aws_vpc_endpoint.ecr_dkr[0]: Refreshing state... [id=vpce-04666cf9ae9d971dc]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=kyeol-stage-rds-subnet-group]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0db7e97b1cc581f44"]: Read complete after 0s [id=rtb-0db7e97b1cc581f44]
module.vpc.aws_vpc_endpoint.logs[0]: Refreshing state... [id=vpce-0ed360106d13a797d]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-06c24fbaedfb5360a"]: Read complete after 0s [id=rtb-06c24fbaedfb5360a]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0b4605bf73e2ffc7c"]: Read complete after 0s [id=rtb-0b4605bf73e2ffc7c]
module.valkey[0].aws_elasticache_subnet_group.main: Refreshing state... [id=kyeol-stage-cache-subnet]
module.eks.aws_eks_cluster.main: Refreshing state... [id=kyeol-stage-eks]
module.vpc.aws_nat_gateway.regional[0]: Refreshing state... [id=nat-19c249784b0a0e57b]
module.vpc.aws_route.private_nat[0]: Refreshing state... [id=r-rtb-0db7e97b1cc581f441080289494]
module.vpc_peering_mgmt[0].aws_route.accepter_to_requester[0]: Refreshing state... [id=r-rtb-0b847a4edf9d94f2d1415821702]
module.vpc_peering_mgmt[0].aws_route.accepter_to_requester[1]: Refreshing state... [id=r-rtb-0db7e97b1cc581f441415821702]
module.rds.aws_db_instance.main: Refreshing state... [id=db-UVITHAUUKW6CKKRBYPH2OEOKXU]
module.eks.aws_eks_addon.cloudwatch_observability: Refreshing state... [id=kyeol-stage-eks:amazon-cloudwatch-observability]
module.eks.aws_eks_node_group.general: Refreshing state... [id=kyeol-stage-eks:kyeol-stage-ng-general]
module.eks.data.tls_certificate.cluster[0]: Reading...
module.rds.aws_secretsmanager_secret_version.rds: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:827913617839:secret:kyeol-stage-rds-creds-934c9f61-raBX7Z|terraform-2026011301183071570000000a]
module.valkey[0].aws_elasticache_replication_group.main: Refreshing state... [id=kyeol-stage-cache]
module.eks.data.tls_certificate.cluster[0]: Read complete after 0s [id=2f4c12273dfce0668da79492f884c5b681951fb9]
module.eks.aws_iam_openid_connect_provider.cluster[0]: Refreshing state... [id=arn:aws:iam::827913617839:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/EC3C36350CAC3CE0A1C05048A34244E6]
module.eks.aws_iam_role.external_dns[0]: Refreshing state... [id=kyeol-stage-external-dns-role]
module.eks.aws_iam_role.fluent_bit[0]: Refreshing state... [id=kyeol-stage-fluent-bit-role]
module.eks.aws_iam_role.alb_controller[0]: Refreshing state... [id=kyeol-stage-alb-controller-role]
module.eks.aws_iam_role_policy.fluent_bit[0]: Refreshing state... [id=kyeol-stage-fluent-bit-role:kyeol-stage-fluent-bit-policy]
module.eks.aws_iam_role_policy.external_dns[0]: Refreshing state... [id=kyeol-stage-external-dns-role:kyeol-stage-external-dns-policy]
module.eks.aws_iam_role_policy.alb_controller[0]: Refreshing state... [id=kyeol-stage-alb-controller-role:kyeol-stage-alb-controller-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.vpc_peering_mgmt[0].aws_route.accepter_to_requester[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_route" "accepter_to_requester" {
      - destination_cidr_block      = "10.40.0.0/16" -> null
      - id                          = "r-rtb-0b847a4edf9d94f2d1415821702" -> null
      - origin                      = "CreateRoute" -> null
      - region                      = "ap-northeast-2" -> null
      - route_table_id              = "rtb-0b847a4edf9d94f2d" -> null
      - state                       = "active" -> null
      - vpc_peering_connection_id   = "pcx-0ae6e5066e4b085d3" -> null
        # (13 unchanged attributes hidden)
    }

  # module.vpc_peering_mgmt[0].aws_route.accepter_to_requester[1] will be destroyed
  # (because resource does not use count)
  - resource "aws_route" "accepter_to_requester" {
      - destination_cidr_block      = "10.40.0.0/16" -> null
      - id                          = "r-rtb-0db7e97b1cc581f441415821702" -> null
      - origin                      = "CreateRoute" -> null
      - region                      = "ap-northeast-2" -> null
      - route_table_id              = "rtb-0db7e97b1cc581f44" -> null
      - state                       = "active" -> null
      - vpc_peering_connection_id   = "pcx-0ae6e5066e4b085d3" -> null
        # (13 unchanged attributes hidden)
    }

  # module.vpc_peering_mgmt[0].aws_route.accepter_to_requester["rtb-0db7e97b1cc581f44"] will be created
  + resource "aws_route" "accepter_to_requester" {
      + destination_cidr_block    = "10.40.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + region                    = "ap-northeast-2"
      + route_table_id            = "rtb-0db7e97b1cc581f44"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-0ae6e5066e4b085d3"
    }

  # module.vpc_peering_mgmt[0].aws_route.requester_to_accepter[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_route" "requester_to_accepter" {
      - destination_cidr_block      = "10.20.0.0/16" -> null
      - id                          = "r-rtb-0f469955ce9f75a5b662290444" -> null
      - origin                      = "CreateRoute" -> null
      - region                      = "ap-northeast-2" -> null
      - route_table_id              = "rtb-0f469955ce9f75a5b" -> null
      - state                       = "active" -> null
      - vpc_peering_connection_id   = "pcx-0ae6e5066e4b085d3" -> null
        # (13 unchanged attributes hidden)
    }

  # module.vpc_peering_mgmt[0].aws_route.requester_to_accepter[1] will be destroyed
  # (because resource does not use count)
  - resource "aws_route" "requester_to_accepter" {
      - destination_cidr_block      = "10.20.0.0/16" -> null
      - id                          = "r-rtb-000b539ccd4cb4e50662290444" -> null
      - origin                      = "CreateRoute" -> null
      - region                      = "ap-northeast-2" -> null
      - route_table_id              = "rtb-000b539ccd4cb4e50" -> null
      - state                       = "active" -> null
      - vpc_peering_connection_id   = "pcx-0ae6e5066e4b085d3" -> null
        # (13 unchanged attributes hidden)
    }

  # module.vpc_peering_mgmt[0].aws_route.requester_to_accepter["rtb-000b539ccd4cb4e50"] will be created
  + resource "aws_route" "requester_to_accepter" {
      + destination_cidr_block    = "10.20.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + region                    = "ap-northeast-2"
      + route_table_id            = "rtb-000b539ccd4cb4e50"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-0ae6e5066e4b085d3"
    }

Plan: 2 to add, 0 to change, 4 to destroy.

Warning: Deprecated attribute

  on ../../modules/eks/outputs.tf line 80, in output "kubeconfig_command":
  80:   value       = "aws eks update-kubeconfig --region ${data.aws_region.current.name} --name ${aws_eks_cluster.main.name}"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 10 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**변경관리 추적 링크:** [Actions Run #9](https://github.com/MSP-Team3/kyeol-infra-terraform/actions/runs/21159128678)
